let startTime = datetime(2025-11-19);
let endTime   = datetime(2025-11-21);
let device    = "azuki-sl";
DeviceLogonEvents
| where DeviceName == device
| where Timestamp between (startTime .. endTime)
| where LogonType in ("Network", "RemoteInteractive")
| where ActionType in ("LogonFailed","LogonSuccess","LogonAttempted")
| project Timestamp, DeviceName, AccountName, ActionType, LogonType, RemoteIP, RemotePort, InitiatingProcessFileName
| order by Timestamp asc
