let startTime = datetime(2025-11-19);
let endTime   = datetime(2025-11-21);
let device    = "azuki-sl";
DeviceNetworkEvents
| where DeviceName == device
| where Timestamp between (startTime .. endTime)
| where ActionType == "ConnectionSuccess"
| where InitiatingProcessFolderPath has @"ProgramData\WindowsCache\svchost.exe"
| project Timestamp, DeviceName, RemoteIP, RemotePort, RemoteUrl, Protocol, InitiatingProcessFileName, InitiatingProcessFolderPath
| order by Timestamp asc
