let startTime = datetime(2025-11-19);
let endTime   = datetime(2025-11-21);
let device    = "azuki-sl";
DeviceProcessEvents
| where DeviceName == device
| where Timestamp between (startTime .. endTime)
| where FileName in~ ("net.exe","net1.exe")
| where ProcessCommandLine has "/add"
| where ProcessCommandLine has_any ("net user", "localgroup")
| project Timestamp, AccountName, FileName, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessCommandLine
| order by Timestamp asc
