let startTime = datetime(2025-11-19);
let endTime   = datetime(2025-11-21);
let device    = "azuki-sl";
DeviceProcessEvents
| where DeviceName == device
| where Timestamp between (startTime .. endTime)
| where FileName in~ ("cmdkey.exe","mstsc.exe")
| project Timestamp, FileName, ProcessCommandLine, AccountName, InitiatingProcessFileName, InitiatingProcessCommandLine
| order by Timestamp asc
